Scorpio "SEquipment.data" ""
--======================--
namespace  "SEquipment.data"
--======================--
L = _Locale
--======================--
-- Constant
--======================--
local ENCHANT_DATA = {
    -- 10.0 巨龙群岛
    -- 好累,手动扒拉数据😩
    ["6643"] = 200054, -- 附魔武器 - 睿智之祈
    ["6625"] = 200030, -- 附魔胸甲 - 觉醒属性
    ["6613"] = 200020, -- 附魔靴子 - 看护者的壤土
    ["6574"] = 200021, -- 附魔护腕 - 闪避之祈
    ["6592"] = 200031, -- 附魔披风 - 优雅闪避
    ["6607"] = 200018, -- 附魔靴子 - 平原奔行者之风
    ["6556"] = 200038, -- 附魔戒指 - 急速之祈
    ["6598"] = 200033, -- 附魔披风 - 再生吸血
    ["6649"] = 200056, -- 附魔武器 - 凝冰之祈
    ["6580"] = 200022, -- 附魔护腕 - 吸血之祈
    ["6562"] = 200039, -- 附魔戒指 - 精通之祈
    ["6604"] = 200032, -- 附魔披风 - 思乡之速
    ["6550"] = 200037, -- 附魔戒指 - 爆击之祈
    ["6586"] = 200023, -- 附魔护腕 - 加速之祈
    ["6655"] = 200058, -- 附魔武器 - 吹拂之祈
    ["6568"] = 200040, -- 附魔戒指 - 全能之祈
    ["6667"] = 200048, -- 附魔工具 - 龙察秋毫
    ["6640"] = 200055, -- 附魔武器 - 睿智之令
    ["6664"] = 200047, -- 附魔工具 - 龙思妙想
    ["6622"] = 200029, -- 附魔胸甲 - 强横力量
    ["6634"] = 200053, -- 附魔武器 - 大地之令
    ["6619"] = 200028, -- 附魔胸甲 - 内敛智力
    ["6631"] = 200050, -- 附魔武器 - 燃烧之祈
    ["6637"] = 200052, -- 附魔武器 - 大地之祈
    ["6661"] = 200046, -- 附魔工具 - 精龙求精
    ["6670"] = 200049, -- 附魔工具 - 龙大物博
    ["6616"] = 200027, -- 附魔胸甲 - 飞速敏捷
    ["6658"] = 200045, -- 附魔工具 - 熟龙生巧
    ["6646"] = 200057, -- 附魔武器 - 凝冰之令
    ["6583"] = 200026, -- 附魔护腕 - 加速之令
    ["6628"] = 200051, -- 附魔武器 - 燃烧之令
    ["6610"] = 200019, -- 附魔靴子 - 骑手的自信
    ["6601"] = 200036, -- 附魔披风 - 加速之令
    ["6589"] = 200034, -- 附魔披风 - 闪避之令
    ["6553"] = 200042, -- 附魔戒指 - 急速之令
    ["6571"] = 200024, -- 附魔护腕 - 闪避之令
    ["6595"] = 200035, -- 附魔披风 - 吸血之令
    ["6547"] = 200041, -- 附魔戒指 - 爆击之令
    ["6652"] = 200059, -- 附魔武器 - 吹拂之令
    ["6559"] = 200043, -- 附魔戒指 - 精通之令
    ["6577"] = 200025, -- 附魔护腕 - 吸血之令
    ["6565"] = 200044, -- 附魔戒指 - 全能之令
    ["6642"] = 200012, -- 附魔武器 - 睿智之祈
    ["6624"] = 199988, -- 附魔胸甲 - 觉醒属性
    ["6648"] = 200014, -- 附魔武器 - 凝冰之祈
    ["6633"] = 200011, -- 附魔武器 - 大地之令
    ["6606"] = 199976, -- 附魔靴子 - 平原奔行者之风
    ["6636"] = 200010, -- 附魔武器 - 大地之祈
    ["6609"] = 199977, -- 附魔靴子 - 骑手的自信
    ["6573"] = 199979, -- 附魔护腕 - 闪避之祈
    ["6654"] = 200016, -- 附魔武器 - 吹拂之祈
    ["6570"] = 199982, -- 附魔护腕 - 闪避之令
    ["6612"] = 199978, -- 附魔靴子 - 看护者的壤土
    ["6639"] = 200013, -- 附魔武器 - 睿智之令
    ["6561"] = 199997, -- 附魔戒指 - 精通之祈
    ["6552"] = 200000, -- 附魔戒指 - 急速之令
    ["6663"] = 200005, -- 附魔工具 - 龙思妙想
    ["6579"] = 199980, -- 附魔护腕 - 吸血之祈
    ["6618"] = 199986, -- 附魔胸甲 - 内敛智力
    ["6627"] = 200009, -- 附魔武器 - 燃烧之令
    ["6591"] = 199989, -- 附魔披风 - 优雅闪避
    ["6603"] = 199990, -- 附魔披风 - 思乡之速
    ["6555"] = 199996, -- 附魔戒指 - 急速之祈
    ["6630"] = 200008, -- 附魔武器 - 燃烧之祈
    ["6564"] = 200002, -- 附魔戒指 - 全能之令
    ["6666"] = 200006, -- 附魔工具 - 龙察秋毫
    ["6645"] = 200015, -- 附魔武器 - 凝冰之令
    ["6651"] = 200017, -- 附魔武器 - 吹拂之令
    ["6585"] = 199981, -- 附魔护腕 - 加速之祈
    ["6576"] = 199983, -- 附魔护腕 - 吸血之令
    ["6582"] = 199984, -- 附魔护腕 - 加速之令
    ["6615"] = 199985, -- 附魔胸甲 - 飞速敏捷
    ["6621"] = 199987, -- 附魔胸甲 - 强横力量
    ["6588"] = 199992, -- 附魔披风 - 闪避之令
    ["6594"] = 199993, -- 附魔披风 - 吸血之令
    ["6600"] = 199994, -- 附魔披风 - 加速之令
    ["6549"] = 199995, -- 附魔戒指 - 爆击之祈
    ["6567"] = 199998, -- 附魔戒指 - 全能之祈
    ["6546"] = 199999, -- 附魔戒指 - 爆击之令
    ["6558"] = 200001, -- 附魔戒指 - 精通之令
    ["6657"] = 200003, -- 附魔工具 - 熟龙生巧
    ["6660"] = 200004, -- 附魔工具 - 精龙求精
    ["6597"] = 199991, -- 附魔披风 - 再生吸血
    ["6669"] = 200007, -- 附魔工具 - 龙大物博
    ["6641"] = 199970, -- 附魔武器 - 睿智之祈
    ["6647"] = 199972, -- 附魔武器 - 凝冰之祈
    ["6611"] = 199936, -- 附魔靴子 - 看护者的壤土
    ["6590"] = 199947, -- 附魔披风 - 优雅闪避
    ["6623"] = 199946, -- 附魔胸甲 - 觉醒属性
    ["6653"] = 199974, -- 附魔武器 - 吹拂之祈
    ["6572"] = 199937, -- 附魔护腕 - 闪避之祈
    ["6605"] = 199934, -- 附魔靴子 - 平原奔行者之风
    ["6554"] = 199954, -- 附魔戒指 - 急速之祈
    ["6665"] = 199964, -- 附魔工具 - 龙察秋毫
    ["6662"] = 199963, -- 附魔工具 - 龙思妙想
    ["6548"] = 199953, -- 附魔戒指 - 爆击之祈
    ["6668"] = 199965, -- 附魔工具 - 龙大物博
    ["6560"] = 199955, -- 附魔戒指 - 精通之祈
    ["6566"] = 199956, -- 附魔戒指 - 全能之祈
    ["6584"] = 199939, -- 附魔护腕 - 加速之祈
    ["6578"] = 199938, -- 附魔护腕 - 吸血之祈
    ["6656"] = 199961, -- 附魔工具 - 熟龙生巧
    ["6644"] = 199973, -- 附魔武器 - 凝冰之令
    ["6617"] = 199944, -- 附魔胸甲 - 内敛智力
    ["6602"] = 199948, -- 附魔披风 - 思乡之速
    ["6620"] = 199945, -- 附魔胸甲 - 强横力量
    ["6596"] = 199949, -- 附魔披风 - 再生吸血
    ["6629"] = 199966, -- 附魔武器 - 燃烧之祈
    ["6614"] = 199943, -- 附魔胸甲 - 飞速敏捷
    ["6659"] = 199962, -- 附魔工具 - 精龙求精
    ["6650"] = 199975, -- 附魔武器 - 吹拂之令
    ["6632"] = 199969, -- 附魔武器 - 大地之令
    ["6626"] = 199967, -- 附魔武器 - 燃烧之令
    ["6608"] = 199935, -- 附魔靴子 - 骑手的自信
    ["6599"] = 199952, -- 附魔披风 - 加速之令
    ["6638"] = 199971, -- 附魔武器 - 睿智之令
    ["6563"] = 199960, -- 附魔戒指 - 全能之令
    ["6635"] = 199968, -- 附魔武器 - 大地之祈
    ["6575"] = 199941, -- 附魔护腕 - 吸血之令
    ["6581"] = 199942, -- 附魔护腕 - 加速之令
    ["6587"] = 199950, -- 附魔披风 - 闪避之令
    ["6545"] = 199957, -- 附魔戒指 - 爆击之令
    ["6551"] = 199958, -- 附魔戒指 - 急速之令
    ["6557"] = 199959, -- 附魔戒指 - 精通之令
    ["6593"] = 199951, -- 附魔披风 - 吸血之令
    ["6569"] = 199940, -- 附魔护腕 - 闪避之令
}
local SET_DATA = {
    [1525] = "狂怒风暴护甲",
    [1524] = "狂怒风暴之鳞",
    [1533] = "美德白银甲胄",
    [1529] = "雷翼劫猎者的伪装",
    [1538] = "行走高山之岩",
    [1528] = "失落唤地者的戎装",
    [1523] = "狂怒风暴之皮",
    [1537] = "鳞誓教徒的向往",
    [1531] = "水晶学士之缚",
    [1526] = "魅影霜巢遗骸",
    [1535] = "牢窟探秘者的工具",
    [1534] = "巨龙圣职者的华服",
    [1536] = "注能大地元素",
    [1527] = "穹缚复仇者的飞行服",
    [1532] = "悟拳裹甲",
    [1521] = "狂怒风暴斗披",
    [1530] = "觉醒者之鳞",
    [1514] = "破龙者的护甲",
    [1510] = "地平线骑手的外衣",
    [1516] = "青纹布法衣",
    [1512] = "破龙者的战甲",
    [1509] = "玩闹幽魂的毛皮",
    [1515] = "纺织时序布甲",
    [1511] = "破龙者的外袍",
    [1513] = "破龙者的外衣",
    [1520] = "巨龙驭手护甲",
}

local STATS_FONT = {
    L["crit"],
    L["haste"],
    L["mastery"],
    L["versa"],
}

local STATS_TEXTURE = "Interface/AddOns/SEquipment/Modules/Texture/crit"
--======================--
-- Class
--======================--
class "SEData" (function (_ENV)
    function GetSetID(id)       return SET_DATA[id]     end
    function GetSetTable()      return SET_DATA         end
    function GetStatsFont(id)   return STATS_FONT[id]   end
    function GetStatsFontTable()     return STATS_FONT       end
    function GetStatsTexture()  return STATS_TEXTURE    end
    function GetEnchantItemID(spellID) return ENCHANT_DATA[spellID] end
end)
