local TongYuGemList = {
    [187079] = "邪坦1",
    [187292] = "邪坦2",
    [187301] = "邪坦3",
    [187310] = "邪坦4",
    [187320] = "邪坦5",

    [187076] = "邪通1",
    [187291] = "邪通2",
    [187300] = "邪通3",
    [187309] = "邪通4",
    [187319] = "邪通5",

    [187073] = "邪输1",
    [187290] = "邪输2",
    [187299] = "邪输3",
    [187308] = "邪输4",
    [187318] = "邪输5",

    [187061] = "血通1",
    [187286] = "血通2",
    [187295] = "血通3",
    [187304] = "血通4",
    [187314] = "血通5",

    [187059] = "血坦1",
    [187285] = "血坦2",
    [187294] = "血坦3",
    [187303] = "血坦4",
    [187313] = "血坦5",

    [187057] = "血输1",
    [187284] = "血输2",
    [187293] = "血输3",
    [187302] = "血输4",
    [187312] = "血输5",

    [187063] = "冰输1",
    [187287] = "冰输2",
    [187296] = "冰输3",
    [187305] = "冰输4",
    [187315] = "冰输5",

    [187071] = "冰坦1",
    [187289] = "冰坦2",
    [187298] = "冰坦3",
    [187307] = "冰坦4",
    [187317] = "冰坦5",

    [187065] = "冰通1",
    [187288] = "冰通2",
    [187297] = "冰通3",
    [187306] = "冰通4",
    [187316] = "冰通5",
}

local GemList = {
    [173121] = "12爆击",
    [173127] = "16爆击",
    [173122] = "12急速",
    [173128] = "16急速",
    [173124] = "12精通",
    [173130] = "16精通",
    [173123] = "12全能",
    [173129] = "16全能",
}
--[[获取统御宝石名称]]
function Bloon(id)
    local number = 0
    if TongYuGemList[id] then
        number = 1
    end
    
    return number
end

function GetDominateName(id)
    return TongYuGemList[id]
end
--[[获取宝石绿字]]
function Gloon(id)
    local number = 0
    if GemList[id] then
        number = 1
    end
    return number
end

function GetGemStat(id)
    return GemList[id]
end
